{
  "id": "199",
  "artist": "g2 &amp; UGP",
  "title": "Wizzop (feat. Mike B. &amp; JAEYOUNG)",
  "year": "2025",
  "album": "Human Tree",
  "genre": "Rap",
  "category": "K-Pop",
  "duration": "03:02",
  "size": "4.32 MB",
  "size128": "",
  "size192": "",
  "size320": "",
  "bitrate": "192",
  "bitrate128": "",
  "bitrate192": "",
  "bitrate320": "",
  "thumb": "https://cdn.jsdelivr.net/gh/caraaink/meownime@2ea09b7b81405783dfc600d208c9eb3d913846e8/cover/rap/g2__UGP_Wizzop_feat_Mike_B__JAEYOUNG.jpg",
  "link": "https://metrolagu.wapkiz.mobi/filedownload/3026156/G2-and-UGP-Wizzop-feat-Mike-B-JAEYOUNG.mp3",
  "link2": "https://drive.google.com/file/d/19VqCk9bZ054KYADcSVN7AomwLJ4XJohc/view?usp=drivesdk",
  "url128": "",
  "url192": "",
  "url320": "",
  "lyricstimestamp": "",
  "lyrics": "<center><b> Lyric g2 & UGP - Wizzop (feat. Mike B. & JAEYOUNG) </b> <br> <br>  <b>[Romanization]</b> <br><br>These days I been stuck in deep space<br> Still searching buzzing barely seeing straight<br> For the number 1 like a pee break<br> Upgrade where' we stay<br> The world is our oyster on a thin plate<br> Careful what you spill<br> Cockroaches to the snakes<br> The haters to the cocksuckers<br> Same old story, like the catalog from blockbusters<br> Me I’m tryna get the bread up like a hot toaster<br> Prayin’ that I’m ballin’ when I cross over<br> So light up pass the za<br> I ain’t worried bout tomorrow<br> Mary Jane she whispers far<br> As I’m drowning in the barrel<br> But I’m,<br> Straight<br> So light up pass the za<br> I ain’t worried bout tomorrow<br> Mary Jane she whispers far<br> As I’m drowning in the barrel<br> But I’m<br> Straight<br> Honeyfilled bees on every corner baby<br> Look up n see there’s beauty all around ya<br> Look 2 yoself just when u need it love<br> There’s beautiful days that’s just around the way, mm<br> Honeyfilled bees on every corner baby<br> Look up n see there’s beauty all around ya<br> Look 2 yoself just when u need it love<br> There’s beautiful days that’s just around the way, mm<br> I found it to be true indeed<br> I chew and eat I do the least, I do indeed<br> I shoot and leave, I found the g that’s in between  the u and p<br> I poo and pee greatness<br> I need space to read faces, so I can see their behaviors<br> I’m seeing colors as weed flavors<br> Man you can ask me what I mean later<br> But don’t be mad if ur screened later<br> I mean I’m prolly at a beach<br> Pardon me I’m at a scene that could be in a screen saver<br> Didn’t mean to be abrupt, but I meant to interrupt ya<br> Hit em with the tough love and sent em into bum fuck<br> I stumbled into something that was untouched<br> Untarnished, untucked<br> <br> Honeyfilled bees on every corner baby<br> Look up n see there’s beauty all around ya<br> Look 2 yoself just when u need it love<br> There’s beautiful days that’s just around the way, mm<br> Honeyfilled bees on every corner baby<br> Look up n see there’s beauty all around ya<br> Look 2 yoself just when u need it love<br> There’s beautiful days that’s just around the way, mm<br> <br> So light up pass the za<br> I ain’t worried bout tomorrow<br> Mary Jane she whispers far<br> As I’m drowning in the barrel<br> But I’m<br> Straight<br> So light up pass the za<br> I ain’t worried bout tomorrow<br> Mary Jane she whispers far<br> As I’m drowning in the barrel<br> But I’m<br> Straight<br><br> <b>[Hangeul]</b> <br><br>These days I been stuck in deep space<br><br>Still searching buzzing barely seeing straight<br><br>For the number 1 like a pee break<br><br>Upgrade where' we stay<br><br>The world is our oyster on a thin plate<br><br>Careful what you spill<br><br>Cockroaches to the snakes<br><br>The haters to the cocksuckers<br><br>Same old story, like the catalog from blockbusters<br><br>Me I’m tryna get the bread up like a hot toaster<br><br>Prayin’ that I’m ballin’ when I cross over<br><br>So light up pass the za<br><br>I ain’t worried bout tomorrow<br><br>Mary Jane she whispers far<br><br>As I’m drowning in the barrel<br><br>But I’m,<br><br>Straight<br><br>So light up pass the za<br><br>I ain’t worried bout tomorrow<br><br>Mary Jane she whispers far<br><br>As I’m drowning in the barrel<br><br>But I’m<br><br>Straight<br><br>Honeyfilled bees on every corner baby<br><br>Look up n see there’s beauty all around ya<br><br>Look 2 yoself just when u need it love<br><br>There’s beautiful days that’s just around the way, mm<br><br>Honeyfilled bees on every corner baby<br><br>Look up n see there’s beauty all around ya<br><br>Look 2 yoself just when u need it love<br><br>There’s beautiful days that’s just around the way, mm<br><br>I found it to be true indeed<br><br>I chew and eat I do the least, I do indeed<br><br>I shoot and leave, I found the g that’s in between  the u and p<br><br>I poo and pee greatness<br><br>I need space to read faces, so I can see their behaviors<br><br>I’m seeing colors as weed flavors<br><br>Man you can ask me what I mean later<br><br>But don’t be mad if ur screened later<br><br>I mean I’m prolly at a beach<br><br>Pardon me I’m at a scene that could be in a screen saver<br><br>Didn’t mean to be abrupt, but I meant to interrupt ya<br><br>Hit em with the tough love and sent em into bum fuck<br><br>I stumbled into something that was untouched<br><br>Untarnished, untucked<br><br><br><br>Honeyfilled bees on every corner baby<br><br>Look up n see there’s beauty all around ya<br><br>Look 2 yoself just when u need it love<br><br>There’s beautiful days that’s just around the way, mm<br><br>Honeyfilled bees on every corner baby<br><br>Look up n see there’s beauty all around ya<br><br>Look 2 yoself just when u need it love<br><br>There’s beautiful days that’s just around the way, mm<br><br><br><br>So light up pass the za<br><br>I ain’t worried bout tomorrow<br><br>Mary Jane she whispers far<br><br>As I’m drowning in the barrel<br><br>But I’m<br><br>Straight<br><br>So light up pass the za<br><br>I ain’t worried bout tomorrow<br><br>Mary Jane she whispers far<br><br>As I’m drowning in the barrel<br><br>But I’m<br><br>Straight</center>",
  "name": "g2 and UGP - Wizzop (feat. Mike B. and JAEYOUNG)",
  "created_at": "2025-06-20T00:38:13.498Z",
  "hits": "3"
}