{
  "id": "207",
  "artist": "g2 &amp; UGP",
  "title": "Borrowed Times (feat. JAEYOUNG)",
  "year": "2025",
  "album": "Human Tree",
  "genre": "Rap",
  "category": "K-Pop",
  "duration": "02:03",
  "size": "2.98 MB",
  "size128": "",
  "size192": "",
  "size320": "",
  "bitrate": "192",
  "bitrate128": "",
  "bitrate192": "",
  "bitrate320": "",
  "thumb": "https://cdn.jsdelivr.net/gh/caraaink/meownime@a6cb1f899ccc7ec859ba2646e89e65cd1d8caff5/cover/rap/g2__UGP_Borrowed_Times_feat_JAEYOUNG.jpg",
  "link": "https://metrolagu.wapkiz.mobi/filedownload/3026148/G2-and-UGP-Borrowed-Times-feat-JAEYOUNG.mp3",
  "link2": "https://drive.google.com/file/d/1yePl84VwjwRSkGbZNvT6rknpWDRHx08K/view?usp=drivesdk",
  "url128": "",
  "url192": "",
  "url320": "",
  "lyricstimestamp": "",
  "lyrics": "<center><b> Lyric g2 & UGP - Borrowed Times (feat. JAEYOUNG) </b> <br> <br>  <b>[Romanization]</b> <br><br>I saw her takin’ shots somewhere' deep in Koreatown where' it all collided<br> I took my shot and I swished it and it was all decided<br> In the city where' the stars align in<br> She told me pour the wine in<br> She was pretty but the ‘r’ was silent<br> Seen the flags and I saw the sirens<br> Deep in the trenches but I called her mine then<br> Seen it coming but still I was blinded<br> I was blinded by the night<br> There was a darkness inside but all my eyes saw were diamonds<br> And it all falls in time and they say timing is everything<br> But time doesn’t wait they say<br> And the mind you shouldn’t waste they say<br> It all falls in line but then you might, have to wait to take<br> Then life becomes a paper chase<br> Your body starts to waste away<br> And then you start asking what we doing this for?<br> Why we do it this long? and why you ruin this for?<br> I’ma be alright tho I just need a light to lead this life<br> Hope you read between  the lines and hope you read it twice<br> <br> I’m feeling spectacular<br> My mind is in the nebulas<br> Head on a swivel<br> While the shorty give me head in the Acura<br> Parties and the alcohol etcetera etcetera<br> Can’t remember shit so I’m posing for the camera<br> For now we in the zone<br> Captured moments on the phone<br> Already feeling kind of old<br> She said anxiety’s for tomorrow<br> So we shooting for the stars<br> Feeling so euphoric but it’s feeling like it’s borrowed<br> As we elevate our taste<br> We alleviate the pain<br> No disclaimers in this game<br> We just go our separate ways<br> All this for another level<br> Till the feeling dissipates<br> Focused on the paper chase<br> 'Cause it’s either make or break<br> Breaking even? That’s too safe<br> I need at least two safes<br> Eight zeros in the bank<br> Respective commas on the way<br> So believe it when I say<br> I’m gonna make it worth my stay<br> Shimmer through the night<br> And we gon’ make it home by day<br><br> <b>[Hangeul]</b> <br><br>I saw her takin’ shots somewhere' deep in Koreatown where' it all collided<br><br>I took my shot and I swished it and it was all decided<br><br>In the city where' the stars align in<br><br>She told me pour the wine in<br><br>She was pretty but the ‘r’ was silent<br><br>Seen the flags and I saw the sirens<br><br>Deep in the trenches but I called her mine then<br><br>Seen it coming but still I was blinded<br><br>I was blinded by the night<br><br>There was a darkness inside but all my eyes saw were diamonds<br><br>And it all falls in time and they say timing is everything<br><br>But time doesn’t wait they say<br><br>And the mind you shouldn’t waste they say<br><br>It all falls in line but then you might, have to wait to take<br><br>Then life becomes a paper chase<br><br>Your body starts to waste away<br><br>And then you start asking what we doing this for?<br><br>Why we do it this long? and why you ruin this for?<br><br>I’ma be alright tho I just need a light to lead this life<br><br>Hope you read between  the lines and hope you read it twice<br><br><br><br>I’m feeling spectacular<br><br>My mind is in the nebulas<br><br>Head on a swivel<br><br>While the shorty give me head in the Acura<br><br>Parties and the alcohol etcetera etcetera<br><br>Can’t remember shit so I’m posing for the camera<br><br>For now we in the zone<br><br>Captured moments on the phone<br><br>Already feeling kind of old<br><br>She said anxiety’s for tomorrow<br><br>So we shooting for the stars<br><br>Feeling so euphoric but it’s feeling like it’s borrowed<br><br>As we elevate our taste<br><br>We alleviate the pain<br><br>No disclaimers in this game<br><br>We just go our separate ways<br><br>All this for another level<br><br>Till the feeling dissipates<br><br>Focused on the paper chase<br><br>'Cause it’s either make or break<br><br>Breaking even? That’s too safe<br><br>I need at least two safes<br><br>Eight zeros in the bank<br><br>Respective commas on the way<br><br>So believe it when I say<br><br>I’m gonna make it worth my stay<br><br>Shimmer through the night<br><br>And we gon’ make it home by day</center>",
  "name": "g2 and UGP - Borrowed Times (feat. JAEYOUNG)",
  "created_at": "2025-06-20T00:38:23.316Z",
  "hits": "3"
}