{
  "id": "31",
  "artist": "Hangzoo",
  "title": "EMERGENCY (Remix) Feat. Won Pound",
  "year": "2025",
  "album": "경보 EMERGENCY (Remix) Feat. Won Pound",
  "genre": "Rap",
  "category": "K-Pop",
  "duration": "03:42",
  "size": "5.13 MB",
  "size128": "",
  "size192": "",
  "size320": "",
  "bitrate": "192",
  "bitrate128": "128",
  "bitrate192": "192",
  "bitrate320": "320",
  "thumb": "https://cdn.jsdelivr.net/gh/caraaink/meownime@ae654ac9266067ced13e7542f53ef885124dfa08/cover/rap/Hangzoo_%EA%B2%BD%EB%B3%B4_EMERGENCY_Remix_Feat_Won_Pound.jpg",
  "link": "https://metrolagu.wapkiz.mobi/filedownload/3025379/EMERGENCY-Remix-Feat-Won-Pound.mp3",
  "link2": "https://drive.google.com/file/d/1Ls5goLtt3sUBJjjK2Mth9n0ICecPsdu8/view?usp=drivesdk",
  "url128": "",
  "url192": "",
  "url320": "",
  "lyricstimestamp": "",
  "lyrics": "<center><b> Lyric Hangzoo - 경보 EMERGENCY (Remix) Feat. Won Pound </b> <br> <br>  <b>[Romanization]</b> <br><br>naega wae seo dulleo yeah I'm fuckin' Slowflow<br> hoksi neo sumttallyeo? mudaeman ham heok heok<br> naega akapella neomgim Beat Makerneun<br> joaseo mak jilleo sori hyeong ㅈdwae igeo<br> naega malhaji ananna neon otsalttaeanya raep mothae<br> nan mareujiella sinsang jjwak ppaeibeun jenteulmonseuteo<br> Fake rappers neohui deoge kkyeo saeganggyeong<br> neon ppajyeoimma gukhip kategori sibalsaekkya<br> (Ayy stupid) To. haters na tto bokgwi<br> naega aju swijil mothae goppi pullin saekki ttaeme<br> geungkka niga manghaji geungkka naega ajik<br> deupbojabilttae ppajyeo jappa teurigijeone<br> na ippal an kka namjaga gappaga itji watda gatda<br> anhae i ssiballoma uisim doemyeon saekkya tteulkka hampan<br> neon jeoldae mot ta ilke hasuhante an ppaetgyeo bapgeureut<br> neo gateun hasu hanten deo goyakhae nan gosu<br> geu pyojeong bosyu ya mwogaaswiwo?<br> nega daeche gyang ttaeryeochigo deureoga gosiwon<br> My existence is poison to you<br> You're a poison to hip hop<br> uimiga dareuji ㅂㅅ<br> EMERGENCY<br> EMERGENCY<br> deoppalli dallyeo naejonjae neohante gyeongbo<br> deoppalli dallyeo naejonjae neohante gyeongbo<br> EMERGENCY<br> i pussy saekkideureun talking like they know me<br> I don't know you bro don't act like you my homie<br> comeback season like Antony<br> Won Pound the one and only<br> toemulsaekki jappajimyeon ni siche wie ollie<br> nal mot arabwa like perry<br> fuck on your bitch John Terry<br> fake rappers you don't scare me<br> nan anggyeongjabi geunde neohante chaewo jamulsoe<br> ne yeojachinggu neoreul bogon moreusoe hae<br> It's still the same old story<br> now it's not even funny<br> boy you been found out phoney<br> emergency you better run<br> this not a race we taking over on the marathon<br> gyeolseungseon dochakhal ttae turn your cameras on<br> EMERGENCY<br> EMERGENCY<br> deoppalli dallyeo naejonjae neohante gyeongbo<br> deoppalli dallyeo naejonjae neohante gyeongbo<br> EMERGENCY<br><br> <b>[Hangeul]</b> <br><br>내가 왜 서 둘러 yeah I'm fuckin' Slowflow<br><br>혹시 너 숨딸려? 무대만 함 헉 헉<br><br>내가 아카펠라 넘김 Beat Maker는<br><br>좋아서 막 질러 소리 형 ㅈ돼 이거<br><br>내가 말하지 않았나 넌 옷살때아냐 랩 못해<br><br>난 마르지엘라 신상 쫙 빼입은 젠틀몬스터<br><br>Fake rappers 너희 덕에 껴 색안경<br><br>넌 빠져인마 국힙 카테고리 시발새꺄<br><br>(Ayy stupid) To. haters 나 또 복귀<br><br>내가 아주 쉬질 못해 고삐 풀린 새끼 땜에<br><br>긍까 니가 망하지 긍까 내가 아직<br><br>듣보잡일때 빠져 자빠 트리기전에<br><br>나 이빨 안 까 남자가 갑빠가 있지 왔다 갔다<br><br>안해 이 씨발놈아 의심 되면 새꺄 뜰까 한판<br><br>넌 절대 못 타 일케 하수한테 안 뺏겨 밥그릇<br><br>너 같은 하수 한텐 더 고약해 난 고수<br><br>그 표정 보슈 야 뭐가아쉬워?<br><br>네가 대체 걍 때려치고 들어가 고시원<br><br>My existence is poison to you<br><br>You're a poison to hip hop<br><br>의미가 다르지 ㅂㅅ<br><br>EMERGENCY<br><br>EMERGENCY<br><br>더빨리 달려 내존재 너한테 경보<br><br>더빨리 달려 내존재 너한테 경보<br><br>EMERGENCY<br><br>이 pussy 새끼들은 talking like they know me<br><br>I don't know you bro don't act like you my homie<br><br>comeback season like Antony<br><br>Won Pound the one and only<br><br>퇴물새끼 자빠지면 니 시체 위에 ollie<br><br>날 못 알아봐 like perry<br><br>fuck on your bitch John Terry<br><br>fake rappers you don't scare me<br><br>난 안경잡이 근데 너한테 채워 자물쇠<br><br>네 여자친구 너를 보곤 모르쇠 해<br><br>It's still the same old story<br><br>now it's not even funny<br><br>boy you been found out phoney<br><br>emergency you better run<br><br>this not a race we taking over on the marathon<br><br>결승선 도착할 때 turn your cameras on<br><br>EMERGENCY<br><br>EMERGENCY<br><br>더빨리 달려 내존재 너한테 경보<br><br>더빨리 달려 내존재 너한테 경보<br><br>EMERGENCY</center>",
  "name": "Hangzoo - 경보 EMERGENCY (Remix) Feat. Won Pound",
  "created_at": "2025-06-19T07:54:57.433Z",
  "hits": "1"
}